using System.Collections.Generic;

namespace ChineseAppWPF.Logic
{
    public static class SentenceExamples
    {
        public static List<string> Examples() => sentences;

        private static readonly List<string> sentences = new List<string>()
        {
            "你喝茶",
            "他是我的同学",
            "我认识他们",
            "天气很好",
            "这是你的桌子吗",
            "我喜欢咖啡和茶",
            "我买了单",
            "为了提高我的汉语水平，我想去中国学习",
            "当我们离开的时候，谁来照顾狗？",
            "他没有他弟弟聪明",
            "如果我很健康，我会很快乐",
            "我妹妹经常哭",
            "我叔叔送了我一个礼物",
            "你会说中文吗",
            "你想喝咖啡还是喝茶？",
            "我们休息一会儿吧",
            "我需要一把伞",
            "告诉我拿它做什么",
            "我必须帮助她",
            "她努力地工作",
            "我需要一个医生",
            "我明白了",
            "我会参加",
            "我已经不喝啤酒了",
            "他一定很爱你",
            "我们准备离开",
            "我们学校的图书馆很小，但是是新的",
            "他在自己房里玩",
            "你用你的照相机做了什么？",
            "跟我们一起来吧",
            "我们需要你的帮助",
            "我们是认真的",
            "讲清楚",
            "他很容易感冒",
            "我现在必须走了",
            "我现在非常饿",
            "我住在这附近",
            "我还年轻",
            "游泳很容易",
            "请马上离开",
            "我没有哥哥",
            "他们在上汉语课呢",
            "昨天我没有吃"
        };
    }
}
